---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFilterType.NotContains
enum: Autodesk.Revit.DB.ScheduleFilterType
source: html/9b696f55-de40-8739-8cfb-decd51995cff.htm
---
# Autodesk.Revit.DB.ScheduleFilterType.NotContains

For a string field, the field value does not contain the specified string.